[
    {
        "text": "Sometimes I just sit and ask myself…\n\nWhy am I in a different city, \nLiving in a rented flat, eating cold food, \nWorking 9 to 10 just to earn money… \nWhen I’m not even feeling like myself?\n\nNobody talks about how lonely it gets.\n\nHow hard it is to make friends as an adult. \nHow awkward it is to ask, ‘Hey, wanna hang out?’ \nHow weird it feels to go to cafes alone, \nOr spend weekends watching series just to avoid overthinking.\n\nWe moved to new cities for ‘better opportunities,’ \nBut no one told us that growth comes with silence, \nWith homesickness, \nWith crying quietly at night and still showing up for the 9 AM call.\n\nSometimes, I just want to go back -\nTo that version of me who laughed loudly with friends, \nWho didn’t check the time before calling someone, \nWho wasn’t ‘busy building a career’ but was simply… happy.\n\nBut if you’re reading this and feel the same, \nJust know: You’re not weak. You’re just human. \nYou’re not alone. You’re just in a new chapter.\n\nAnd it’s okay to pause, breathe, and admit… \nThat adulting is hard.\n\nBut we’ll figure it out -\nOne lonely dinner, one new connection, one hopeful day at a time.",
        "engagement": 0,
        "line_count": 10,
        "language": "English",
        "tags": [
            "Adulting",
            "Mental Health"
        ]
    },
    {
        "text": "Rapido drivers never asked for much.\nJust a way to earn an honest living.\n\nKarnataka High Court asked Rapido and other bike taxi services to suspend operations until proper guidelines are made.\nAnd honestly, it’s heartbreaking.\n\nBecause for us, it’s just news.\n For them, it’s their only source of income… gone overnight.\n\nYou must’ve met them -\n The college student riding in between classes to pay his rent.\n The single mom who juggles housework and rides to keep her kids in school.\n The man who left his village and came to the city hoping to earn, riding 12 hours a day just to survive.\n\nMost of them don’t have savings.\nThey don't have backup plans.\nThey have families to feed, bills to pay, and now… no work.\n\nNo one’s saying rules shouldn’t exist.\nBut can we at least create guidelines without taking away someone’s rozi-roti?\n\nThese are not just riders.\nThey’re people trying to do the right thing - earn money without begging, stealing, or depending on anyone.\n\nI hope the government moves fast.\nBecause for many, every day without work is a day without food.",
        "engagement": 24,
        "line_count": 4,
        "language": "English",
        "tags": [
            "Economy",
            "Social"
        ]
    },
    {
        "text": "Every morning, you look in the mirror.\n\nYou see the tired eyes.\n The unwashed hair.\n The bloated face.\n The stretch marks, the scars, the pimples.\n\nAnd you whisper…\n'I look terrible.'\n\nBut let me tell you something strange:\nYour mirror doesn’t show the full you.\n\nIt doesn’t show the way you stayed up all night to help a friend.\n Or how your laugh makes the whole room feel lighter.\n It doesn’t show the strength it took to just show up today.\n\nYour mirror can only reflect your skin.\n It doesn’t reflect your story.\n\nAnd you are more than your bad hair day.\n You are more than your weight, your job title, your LinkedIn headline.\n\nYou are the sum of every storm you’ve survived.\n And every quiet sunrise you didn’t post about.\n\n🌤 So next time you look in the mirror - smile.\n Not because you look perfect.\n But because you're still here.",
        "engagement": 234,
        "line_count": 2,
        "language": "English",
        "tags": [
            "Personal Growth",
            "Motivation"
        ]
    },
    {
        "text": "This Generation Got Played - And No One Talks About It\n\nThere was a time when people told us:\n✨ Study hard, get a degree, and you’ll have a stable job.\n✨ Loyalty to a company will reward you.\n✨ If you work hard, life will be easy.\n\nThey lied.\n\nHouses? Too expensive. Even if you earn well, good luck affording one.\n\nSalaries? Not keeping up with inflation. Meanwhile, CEOs get 2000% hikes.\n\nJob security? You could be replaced by AI, automation, or the next ‘cost-cutting’ trend.\n\nWork-life balance? A myth. We answer emails at midnight and feel guilty for taking a break.\n\nOlder generations tell us, ‘You guys don’t work as hard as we did.’\n\nBut they didn’t have:\n🚩 Unpaid internships.\n🚩 Endless job rejections even with experience.\n🚩 14-step interview processes just to be ghosted.\n🚩 Overqualification being a problem.\n🚩 Side hustles just to afford basic expenses.\n\nWe were sold a dream that doesn’t exist anymore.\n\nYet, we’re told we’re ‘too sensitive.’ That we just need to ‘stop complaining and grind harder.’\n\nBut how do you grind when:\n📌 Rent is half your paycheck?\n📌 Therapy is a luxury?\n📌 Every passion turns into a side hustle just to survive?\n\nThis generation isn’t ‘lazy.’\nThis generation is exhausted.\n\nWe adapt, we hustle, we fight for mental health, we question toxic work cultures, we learn new skills every year just to stay relevant.\n\nAnd we still get blamed.\n\nIt’s not that we’re afraid of hard work.\nIt’s just that the world has changed - \nAnd no one prepared us for it.",
        "engagement": 456,
        "line_count": 34,
        "language": "English",
        "tags": [
            "Mental Health",
            "Career"
        ]
    },
    {
        "text": "Every time I try to cross a road nowadays, I get the same feeling -\n\nHow busy people are with their lives, how desperately they want to reach their destination, they'll not care if they'll hit/hurt you in between.\n\nEveryone is overtaking, someone is coming from the wrong side, even when a car stops for me so that I can cross the road, usually there's an activa coming from the backside that'll go before me.\n\nNo one pauses. No one waits. No one cares.\n\nIt's sad man, really sad.\n\nEveryone is so busy, no one cares about the other's safety!\n\nAnd honestly, isn’t this the perfect metaphor for life too?\n\nPeople are always in a rush - chasing deadlines, running behind promotions, hustling for success. And in that race, they barely notice who they push aside, who they inconvenience, or who gets left behind.\n\nNo one pauses. No one waits. No one cares.\n\nJust like on the roads, in life too, we see rule-breakers getting ahead, those who follow the right path struggling, and the ones who stop to help others often being the last to move forward.\n\nMaybe it's time we all slowed down a little.\n\nNo matter how fast we run, we’re all going to reach somewhere eventually. The real question is - will we reach with kindness or will we reach alone?\n\nBecause what’s the point of reaching your destination if you’ve hurt people along the way?",
        "engagement": 444,
        "line_count": 24,
        "tags": [
            "Motivation",
            "Life"
        ]
    },
    {
        "text": "What will happen if people start adding their salaries in their work experience?\n\nFew things I can think of -\n\nMore Rishtas coming your way if you earn nice :)\n\nMore Rishtedaar taane/jealousy \n\nLess pyaar more vyapaar\n\nFriends calculating how many parties you owe them – 'Bhai, tera 30% hike ka matlab 3 extra Zomato orders per week hai.'\n\nCousins asking for ‘small loans’ – 'Bas ₹50k urgent chahiye, tu toh easily de sakta hai!'\n\nParents emotionally blackmailing – 'Itna kamata hai, par ghar pe toh ek AC bhi nahi lagwaya.'\n\nColleagues will finally know who is being underpaid (Office gossip level: Legendary)\n\nSalary hiders will say ‘Salary doesn’t define me’ (Bro, we just asked, not proposing marriage)\n\nEndless possibilities man!",
        "engagement": 56,
        "line_count": 12,
        "language": "Hinglish",
        "tags": [
            "Workplace",
            "Humor"
        ]
    },
    {
        "text": "This generation is not okay.\n\nWe are the most connected generation in history - yet we feel lonelier than ever.\n\nWe have:\n\nFriends in every corner of the world but no one to call when we break down at 2 AM.\n\nThousands of likes on selfies but no one who genuinely likes us for who we are.\n\nA ‘perfect’ life online but an empty, exhausted soul in reality.\n\nLook around:\n\nPeople are dating just to avoid being alone. Love is no longer about connection - it’s about convenience.\n\nLooks matter more than loyalty. A six-pack gets more respect than a kind heart.\n\nLuxury is being bought on EMI. We’d rather impress strangers than build real financial stability.\n\nSuccess is about looking successful. People rent expensive cars for Instagram but can’t afford their rent.\n\nFriendships are based on utility. 'What can you do for me?' matters more than genuine care.\n\nBreakups are text messages. Ghosting is normal. Cheating is just a 'mistake.'\n\nMarriage is seen as a burden. People want weddings, not lifelong commitments.\n\nJobs drain us. We work long hours, burn out, and call it 'hustle.'\n\nCheating is normal. People call it a 'mistake' while someone’s life falls apart.\n\nFake people win. The ones who manipulate, step over others, and lie get ahead.\n\nMental health is a trend. Everyone posts about it, but no one listens when someone truly struggles.\n\nSuccess is about flexing, not achieving. Rent a luxury car, post a reel, fool the world.\n\nKindness is a performance. Show empathy online, be rude in real life.\n\nRelationships are temporary. Love today, cheat tomorrow, move on the next day.\n\nLoyalty is outdated. Who needs commitment when you have options?\n\nIf you're kind, pure, and loyal, this world will use you, break you, and leave you behind.\n\nIf you're too nice, people will take advantage of you.\n\nIf you're too honest, people will call you naïve.\n\nIf you're too loyal, people will treat you like an option.\n\nIf you're too genuine, people will think you're weak.\n\nWe chase things we don’t even want - just because the world tells us to.\n\nWe seek validation from people who wouldn’t even show up to our funeral.\n\nWe’re so scared of being left out that we forget what actually matters.\n\nMaybe the problem isn’t society. Maybe it’s us.\nMaybe we need to stop chasing, stop flexing, stop pretending.\n\nMaybe the real flex is peace.\n\nMaybe real success is having people who love you.\n\nMaybe true happiness is living for yourself, not for likes.\n\nP.s - The writer in me was dying to come out today and write!! So, sorry for the long post :)",
        "engagement": 90,
        "line_count": 44,
        "language": "English",
        "tags": [
            "Society",
            "Self Reflection"
        ]
    },
    {
        "text": "If you're constantly seeing motivational posts like 'I wake up at 4 AM, meditate for an hour, run a marathon, and close five deals before breakfast,' I just want to remind you… it’s okay to sleep in till 10 AM and stare at the ceiling questioning life.\n\nWe all sometimes feel like we’re falling behind - people are getting dream jobs, buying houses, launching startups, and here we are… *celebrating the fact that we finally did our laundry.*\n\nBut you know what? *That’s okay.* \n\nLife is not a productivity contest. Some people sprint, some people jog, and some (like me) take snack breaks every five minutes. The goal is to *not burn out before reaching the finish line.* \n\nSo if you need a break, take it. If you want to rest, do it guilt-free. *Your worth is not measured by how many ‘grindset’ reels you watch.* \n\nAnd remember, even your phone needs to recharge. So why shouldn’t you?\n\nP.s - If you read till here, I am just curious about why you follow me, like what exactly do you like about my posts? I have been doing some analysis, and I hope to bring something more on the table that you'll like :))\n\nYou guys have met Luna already, now meet Shadow (I adopted Shadow from my college and she lives in my hometown with my family, honestly she's my first child :). Also, Luna and Shadow are good friends 🌞)",
        "engagement": 789,
        "line_count": 7,
        "language": "English",
        "tags": [
            "Motivation",
            "Self Care"
        ]
    },
    {
        "text": "Why should a corporate majdoor go to the gym?\n\nChannelise your anger, lift heavy and next time when a jerk comes and taunts you for your work, you'll feel the power - I deadlifted 145 today, I can deadlift 2 of him.\n\nYou'll not have to worry about your mental health anymore. Start running and you'll be confused - which is worse? my mental health or my physical health?\n\nYou'll stop overthinking. Because instead of lying awake at night questioning your life choices, you'll be passed out by 10 PM thinking — Was that my last set or did I black out?\n\nAnd forget office politics — once you hit leg day properly, the only thing you'll be thinking is, 'How do I climb these 3 stairs without crying?'\n\nThe next time someone dumps extra work on you at 6 PM, you won't get angry - you'll smile and think, 'I'll use this frustration to hit a new PR tomorrow.'\n\nCardio will teach you life’s biggest lesson - no matter how fast you run, you can’t escape your problems… or your boss's 7 AM meeting invite.",
        "engagement": 0,
        "line_count": 14,
        "language": "Hinglish",
        "tags": [
            "Fitness",
            "Humor"
        ]
    }
]